Revit 2026 API

# TextBoxData Properties

---

The TextBoxData type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Image | The image of the TextBox. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from ItemData) |
|  | LongDescription | Long description of the command tooltip (Inherited from RibbonItemData) |
|  | Name | The internal name of the item. (Inherited from ItemData) |
|  | ToolTip | The tooltip of item. (Inherited from ItemData) |
|  | ToolTipImage | The image to show as a part of the button extended tooltip (Inherited from RibbonItemData) |

#### Reference

TextBoxData Class

Autodesk.Revit.UI Namespace